src/cf/DataProcessors/ор_ОбратнаяСвязь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ор_ОбратнаяСвязь</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресВоВременномХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/ор_ОбратнаяСвязь/Forms/ФормаОбратнойСвязи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	НаименованиеКонфигурации  = Метаданные.КраткаяИнформация;
	ТекущаяВерсияКонфигурации = Метаданные.Версия;
	ТекущийШаг                = 1;
	ВсегоШагов                = КоличествоШаговПомощника();
	АдресХранилища            = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	Элементы.ДекорацияУважаемыйПользователь.Заголовок = 
		СтрЗаменить(
			Элементы.ДекорацияУважаемыйПользователь.Заголовок,
			"НаименованиеКонфигурации",
			НаименованиеКонфигурации);
	
	// Отправка обращений разрешена только для пользователей с полными правами
	ЕстьПравоНаОтправкуОбращений = Пользователи.ЭтоПолноправныйПользователь(, Ложь, Ложь);
	
	// Данные интернет поддержки
	УстановитьПривилегированныйРежим(Истина);
	ДанныеИнтернетПоддержки = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
	УстановитьПривилегированныйРежим(Ложь);
	ПодключенаИнтернетПоддержка = (ДанныеИнтернетПоддержки <> Неопределено);
	Элементы.ДекорацияПодключитьИнтернетПоддержку.Видимость = НЕ ПодключенаИнтернетПоддержка;
	Если ПодключенаИнтернетПоддержка Тогда
		ЛогинПользователя = ДанныеИнтернетПоддержки.Логин;
		РегистрационныйНомер = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
									ИнтернетПоддержкаПользователей.ИдентификаторПодсистемы(), "regnumber");;
	КонецЕсли;
	
	Если ЕстьПравоНаОтправкуОбращений Тогда
		ПараметрыЦентраМониторинга = ПолучитьПараметрыЦентраМониторинга();
		ЦентрМониторингаРазрешитьОтправлятьДанные = ПолучитьПереключательОтправкиДанных(
														ПараметрыЦентраМониторинга.ВключитьЦентрМониторинга,
														ПараметрыЦентраМониторинга.ЦентрОбработкиИнформацииОПрограмме);
		
		ПараметрыСервиса = Новый Структура("Сервер, АдресРесурса, Порт");
		
		Если ЦентрМониторингаРазрешитьОтправлятьДанные = 0 Тогда
			ПараметрыСервиса.Сервер       = ПараметрыЦентраМониторинга.СерверПоУмолчанию;
			ПараметрыСервиса.АдресРесурса = ПараметрыЦентраМониторинга.АдресРесурсаПоУмолчанию;
			ПараметрыСервиса.Порт         = ПараметрыЦентраМониторинга.ПортПоУмолчанию;
		ИначеЕсли ЦентрМониторингаРазрешитьОтправлятьДанные = 1 Тогда
			ПараметрыСервиса.Сервер       = ПараметрыЦентраМониторинга.Сервер;
			ПараметрыСервиса.АдресРесурса = ПараметрыЦентраМониторинга.АдресРесурса;
			ПараметрыСервиса.Порт         = ПараметрыЦентраМониторинга.Порт;
		ИначеЕсли ЦентрМониторингаРазрешитьОтправлятьДанные = 2 Тогда
			ПараметрыСервиса = Неопределено;
		КонецЕсли;
		
		Если ПараметрыСервиса <> Неопределено Тогда
			
			Если ПараметрыСервиса.Порт = 80 Тогда
				Схема = "http://";
				Порт = "";
			ИначеЕсли ПараметрыСервиса.Порт = 443 Тогда
				Схема = "https://";
				Порт = "";
			Иначе
				Схема = "http://";
				Порт = ":" + Формат(ПараметрыСервиса.Порт, "ЧН=0; ЧГ=");
			КонецЕсли;
			
			ЦентрМониторингаАдресСервиса = Схема + ПараметрыСервиса.Сервер + Порт + "/" + ПараметрыСервиса.АдресРесурса;
		Иначе
			ЦентрМониторингаАдресСервиса = "";
		КонецЕсли;
		
		Элементы.ЦентрМониторингаАдресСервиса.Доступность = (ЦентрМониторингаРазрешитьОтправлятьДанные = 1);
		Элементы.ЦентрМониторингаНастройки.Доступность    = (ЦентрМониторингаРазрешитьОтправлятьДанные <> 2);
	КонецЕсли;

	// Подготовим помощник
	ПодготовитьСтруктуруПроверяемыхРеквизитов();
	ПодготовитьСписокСтраницПомощника();
	УстановитьТекстПриложенныеФайлы();
	УстановитьУчетнуюЗапись();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПерваяСтраница = СписокСтраницПомошника[0].Значение;
	Элементы.СтраницыОпроса.ТекущаяСтраница = Элементы[ПерваяСтраница];
	
	УстановитьКнопкиКоманднойПанели();
	УстановитьЗаголовокФормы();
	
	ВидПриложения = ВидПриложения();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ПроверяемыеРеквизиты);
	
	ИмяТекущейСтраницы = СписокСтраницПомошника.Получить(ТекущийШаг - 1).Значение;
	Если СтруктураПроверяемыхРеквизитов.Свойство(ИмяТекущейСтраницы) Тогда
		МассивПроверяемыхРеквизитовСтраницы = СтруктураПроверяемыхРеквизитов[ИмяТекущейСтраницы];
		НепроверяемыеРеквизиты = 
			ОбщегоНазначенияКлиентСервер.РазностьМассивов(НепроверяемыеРеквизиты, МассивПроверяемыхРеквизитовСтраницы);
	КонецЕсли;
	
	Если ВРег(ИмяТекущейСтраницы) = ВРег("СтраницаРегистрационнаяИнформация") Тогда
		Если ЗначениеЗаполнено(АдресОтвета)
			И НЕ ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(АдресОтвета) Тогда
			ТекстОшибки = НСтр("ru='Указан некорректный адрес электронной почты.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "АдресОтвета", , Отказ);
		КонецЕсли;
		Если ЗначениеЗаполнено(РегистрационныйНомер)
			И СтрДлина(РегистрационныйНомер) < 8 Тогда
			ТекстОшибки = НСтр("ru = 'Указан некорректный регистрационный номер.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "РегистрационныйНомер", , Отказ);
		КонецЕсли;
		Если ЦентрМониторингаРазрешитьОтправлятьДанные <> 0 Тогда
			ТекстОшибки = НСтр("ru='Необходимо разрешить отправку статистики.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "ЦентрМониторингаРазрешитьОтправлятьДанные", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияНаКоторуюПрограммаЗарегистрированаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Организации") И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ПараметрыОрганизации = ПараметрыОрганизации(ВыбранноеЗначение);
		ОрганизацияНаКоторуюПрограммаЗарегистрирована = ПараметрыОрганизации.Наименование;
		ИННОрганизации = ПараметрыОрганизации.ИНН;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстПриложенныеФайлыПожеланиеНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьПриложенныеФайлы(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьОтправлятьДанныеПриИзменении(Элемент)
	Перем РезультатЗапуска;
	Элементы.ЦентрМониторингаАдресСервиса.Доступность = (ЦентрМониторингаРазрешитьОтправлятьДанные = 1);
	Элементы.ЦентрМониторингаНастройки.Доступность = (ЦентрМониторингаРазрешитьОтправлятьДанные <> 2);
	Если ЦентрМониторингаРазрешитьОтправлятьДанные = 2 Тогда
		ПараметрыЦентраМониторингаЗапись = Новый Структура("ВключитьЦентрМониторинга, ЦентрОбработкиИнформацииОПрограмме", Ложь, Ложь);
	ИначеЕсли ЦентрМониторингаРазрешитьОтправлятьДанные = 1 Тогда
		ПараметрыЦентраМониторингаЗапись = Новый Структура("ВключитьЦентрМониторинга, ЦентрОбработкиИнформацииОПрограмме", Ложь, Истина);
	ИначеЕсли ЦентрМониторингаРазрешитьОтправлятьДанные = 0 Тогда
		ПараметрыЦентраМониторингаЗапись = Новый Структура("ВключитьЦентрМониторинга, ЦентрОбработкиИнформацииОПрограмме", Истина, Ложь);
	КонецЕсли;
	ЦентрМониторингаАдресСервиса = ПолучитьАдресСервиса();
	РазрешитьОтправлятьДанныеПриИзмененииНаСервере(ПараметрыЦентраМониторингаЗапись, РезультатЗапуска);
	Если РезультатЗапуска <> Неопределено Тогда
		ЦентрМониторингаИдентификаторЗадания = РезультатЗапуска.ИдентификаторЗадания;
		ЦентрМониторингаАдресРезультатаЗадания = РезультатЗапуска.АдресРезультата;
		МодульЦентрМониторингаКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЦентрМониторингаКлиент");
		Оповещение = Новый ОписаниеОповещения("ПослеОбновленияИдентификатора", МодульЦентрМониторингаКлиент);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗапуска, Оповещение, ПараметрыОжидания); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦентрМониторингаАдресСервисаПриИзменении(Элемент)
	Попытка
		СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(ЦентрМониторингаАдресСервиса);
		
		Если СтруктураАдреса.Схема = "http" Тогда
			СтруктураАдреса.Вставить("ЗащищенноеСоединение", Ложь);
		ИначеЕсли СтруктураАдреса.Схема = "https" Тогда
			СтруктураАдреса.Вставить("ЗащищенноеСоединение", Истина);
        Иначе
            СтруктураАдреса.Вставить("ЗащищенноеСоединение", Ложь);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтруктураАдреса.Порт) Тогда
			Если СтруктураАдреса.Схема = "http" Тогда
				СтруктураАдреса.Порт = 80;
			ИначеЕсли СтруктураАдреса.Схема = "https" Тогда
				СтруктураАдреса.Порт = 443;
            Иначе
                СтруктураАдреса.Порт = 80;
			КонецЕсли;
		КонецЕсли;
	Исключение
		// Внимание, формат адреса должен соответствовать RFC 3986 
		// см. описание функции ОбщегоНазначенияКлиентСервер.СтруктураURI.
		ОписаниеОшибки = НСтр("ru = 'Адрес сервиса'; en = 'Service address'") + " "
			+ ЦентрМониторингаАдресСервиса + " "
			+ НСтр("ru = 'не является допустимым адресом веб-сервиса для отправки отчетов об использовании программы.'; en = 'not allowable address of the web service for sending the application usage reports.'"); 
		ВызватьИсключение(ОписаниеОшибки);
	КонецПопытки;
	
	ЦентрМониторингаАдресСервисаПриИзмененииНаСервере(СтруктураАдреса);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВложения

&НаКлиенте
Процедура ВложенияПередУдалением(Элемент, Отказ)
	
	НаименованиеВложения = Элемент.ТекущиеДанные[Элемент.ТекущийЭлемент.Имя];
	
	Для Каждого Вложение Из Объект.Вложения Цикл
		Если Вложение.Представление = НаименованиеВложения Тогда
			Объект.Вложения.Удалить(Вложение);
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьПредставлениеВложений();
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ДобавитьФайлВоВложения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьВложение();
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Файл") Тогда
		ДополнительныеПараметры = Новый Структура("Имя", ПараметрыПеретаскивания.Значение.Имя);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВложенияПеретаскиваниеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		НачатьПомещениеФайла(ОписаниеОповещения, , ПараметрыПеретаскивания.Значение.ПолноеИмя, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияПеретаскиваниеЗавершение(Результат, АдресВременногоХранилища, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Файлы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Новый ОписаниеПередаваемогоФайла(ДополнительныеПараметры.Имя, АдресВременногоХранилища));
	
	ДобавитьФайлыВСписок(Файлы);
	ОбновитьПредставлениеВложений();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	
	Если ЭтоСтраницаОтправки() Тогда
		ОтправитьПочтовоеСообщение();
	Иначе
		ПерейтиКСледующейСтранице();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	ТекущийШаг                              = ТекущийШаг - 1;
	ИмяПредыдущейСтраницы                   = СписокСтраницПомошника.Получить(ТекущийШаг - 1).Значение;
	Элементы.СтраницыОпроса.ТекущаяСтраница = Элементы[ИмяПредыдущейСтраницы];
	
	УстановитьКнопкиКоманднойПанели();
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОрганизацию(Команда)
	
	ПараметрыВыбора = Новый Структура();
	ПараметрыВыбора.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму(
		"Справочник.Организации.ФормаСписка",
		ПараметрыВыбора,
		Элементы.ОрганизацияНаКоторуюПрограммаЗарегистрирована,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриложитьФайлы(Команда)
	ДобавитьФайлВоВложения();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьИлиСнятьФлажкиОтраслевыхМеханизмов(Истина)
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьИлиСнятьФлажкиОтраслевыхМеханизмов(Ложь)
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ОткрытьВложение();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеФормой

&НаСервере
Процедура ПодготовитьСписокСтраницПомощника()
	
	Если ЕстьПравоНаОтправкуОбращений Тогда
		СписокСтраницПомошника.Добавить("СтраницаОценивания");
		СписокСтраницПомошника.Добавить("СтраницаЧастоИспользуемыеОтраслевыеМеханизмы");
		СписокСтраницПомошника.Добавить("СтраницаПовышениеУдобстваРаботы");
		СписокСтраницПомошника.Добавить("СтраницаПожеланиеПоРазвитию");
		СписокСтраницПомошника.Добавить("СтраницаРегистрационнаяИнформация");
		СписокСтраницПомошника.Добавить("СтраницаОтправкаСообщения");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьСтруктуруПроверяемыхРеквизитов()
	
	СтруктураПроверяемыхРеквизитов = Новый Структура;
	СтруктураПроверяемыхРеквизитов.Вставить("СтраницаРегистрационнаяИнформация", Новый Массив);
	СтруктураПроверяемыхРеквизитов.СтраницаРегистрационнаяИнформация.Добавить("РегистрационныйНомер");
	СтруктураПроверяемыхРеквизитов.СтраницаРегистрационнаяИнформация.Добавить("ОрганизацияНаКоторуюПрограммаЗарегистрирована");
	СтруктураПроверяемыхРеквизитов.СтраницаРегистрационнаяИнформация.Добавить("ИННОрганизации");
	СтруктураПроверяемыхРеквизитов.СтраницаРегистрационнаяИнформация.Добавить("ИмяПользователя");
	СтруктураПроверяемыхРеквизитов.СтраницаРегистрационнаяИнформация.Добавить("Должность");
	СтруктураПроверяемыхРеквизитов.СтраницаРегистрационнаяИнформация.Добавить("АдресОтвета");
	
КонецПроцедуры

&НаКлиенте
Функция МожноПерейтиДалее()
	
	Результат = Истина;
	Если НЕ ПодключенаИнтернетПоддержка Тогда
		ТекстВопроса = НСтр("ru='Для отправки сообщений
			|необходимо подключиться к интернет-поддержке пользователей.
			|Подключиться сейчас?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержку", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Результат = Ложь;
	ИначеЕсли НЕ ПроверитьЗаполнение() Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоСтраницаОтправки()

	Возврат (Элементы.СтраницыОпроса.ТекущаяСтраница = Элементы.СтраницаОтправкаСообщения);

КонецФункции

&НаКлиенте
Процедура ПерейтиКСледующейСтранице()

	Если Не МожноПерейтиДалее() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийШаг           = ТекущийШаг + 1;
	ИмяСледующейСтраницы = СписокСтраницПомошника.Получить(ТекущийШаг - 1).Значение;
	Элементы.СтраницыОпроса.ТекущаяСтраница = Элементы[ИмяСледующейСтраницы];
	
	УстановитьКнопкиКоманднойПанели();
	УстановитьЗаголовокФормы();
	
	Если ЭтоСтраницаОтправки() Тогда
		СформироватьТекстСообщения();
		ОбновитьПредставлениеВложений();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КоличествоШаговПомощника()
	
	Возврат 6;
	
КонецФункции

&НаКлиенте
Процедура УстановитьКнопкиКоманднойПанели()
	
	ПерваяСтраница = СписокСтраницПомошника[0].Значение;
	Если Элементы.СтраницыОпроса.ТекущаяСтраница = Элементы[ПерваяСтраница] Тогда
		Элементы.Далее.Заголовок = НСтр("ru='Далее'");
		Элементы.Назад.Доступность = Ложь;
	ИначеЕсли ЭтоСтраницаОтправки() Тогда
		Элементы.Далее.Заголовок = НСтр("ru='Отправить сообщение'");
		Элементы.Назад.Доступность = Истина;
	Иначе
		Элементы.Далее.Заголовок = НСтр("ru='Далее'");
		Элементы.Назад.Доступность = Истина;
	КонецЕсли;
	
	Если Элементы.СтраницыОпроса.ТекущаяСтраница = Элементы.СтраницаЧастоИспользуемыеОтраслевыеМеханизмы Тогда
		Элементы.ГруппаФлажки.Видимость = Истина;
	Иначе
		Элементы.ГруппаФлажки.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.Далее.Доступность = ЕстьПравоНаОтправкуОбращений;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	
	Если Не ЕстьПравоНаОтправкуОбращений Тогда
		Заголовок = НСтр("ru='Форма обратной связи недоступна. Отправка разрешена только для пользователей с полными правами'");
	Иначе
		Заголовок = СтрШаблон(НСтр("ru='Обратная связь: шаг %1 из %2'"), ТекущийШаг, ВсегоШагов);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ВидПриложения()
	
	#Если ВебКлиент Тогда
	Возврат НСтр("ru = 'Веб-клиент'");
	#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
	Возврат НСтр("ru = 'Толстый клиент, обычное приложение'");
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение Тогда
	Возврат НСтр("ru = 'Толстый клиент, управляемое приложение'");
	#ИначеЕсли ТонкийКлиент Тогда
	Возврат НСтр("ru = 'Тонкий клиент'");
	#Иначе
	Возврат "";
	#КонецЕсли
	
КонецФункции

&НаСервереБезКонтекста
Функция ПараметрыОрганизации(Организация)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "Наименование, ИНН");
	
КонецФункции

&НаКлиенте
Процедура УстановитьИлиСнятьФлажкиОтраслевыхМеханизмов(Признак)
	
	МассивСтруктурРеквизитов = ПолучитьМассивСтруктурРеквизитовОтраслевыхМеханизмов();
	Для Каждого ЭлементМассива Из МассивСтруктурРеквизитов Цикл
		ЭтотОбъект[ЭлементМассива.ИмяРеквизита] = Признак;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСВложениями

&НаСервере
Процедура УстановитьТекстПриложенныеФайлы()
	
	Если Объект.Вложения.Количество() > 0 Тогда
		ТекстПриложенныеФайлы = СтрШаблон("Приложенные файлы (%1)", Объект.Вложения.Количество());
		ЭтоГиперссылка        = Истина;
		ЦветТекста            = ЦветаСтиля.ЦветГиперссылки;
	Иначе
		ТекстПриложенныеФайлы = НСтр("ru='Нет приложенных файлов'");
		ЭтоГиперссылка        = Ложь;
		ЦветТекста            = ЦветаСтиля.ПоясняющийТекст;
	КонецЕсли;
	
	Элементы.ТекстПриложенныеФайлыПожелание.Гиперссылка   = ЭтоГиперссылка;
	Элементы.ТекстПриложенныеФайлыПожелание.ЦветТекста    = ЦветТекста;
	
	Элементы.ТекстПриложенныеФайлыПоРазвитию.Гиперссылка    = ЭтоГиперссылка;
	Элементы.ТекстПриложенныеФайлыПоРазвитию.ЦветТекста     = ЦветТекста;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеВложений()
	
	ПредставлениеВложений.Очистить();
	
	Индекс = 0;
	
	Для Каждого Вложение Из Объект.Вложения Цикл
		Если Индекс = 0 Тогда
			СтрокаПредставления = ПредставлениеВложений.Добавить();
		КонецЕсли;
		
		СтрокаПредставления["Вложение" + Строка(Индекс + 1)] = Вложение.Представление;
		
		Индекс = Индекс + 1;
		Если Индекс = 2 Тогда 
			Индекс = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлВоВложения()
	
	Оповещение = Новый ОписаниеОповещения("ДобавитьФайлВоВложенияПриПомещенииФайлов", ЭтотОбъект);
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	
	ФайловаяСистемаКлиент.ЗагрузитьФайлы(Оповещение, ПараметрыЗагрузки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьФайлыВСписок(ПомещенныеФайлы)
	
	Для Каждого ОписаниеФайла Из ПомещенныеФайлы Цикл
		СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ОписаниеФайла.Имя);
		Вложение = Объект.Вложения.Добавить();
		Вложение.Представление             = СтруктураИмениФайла.Имя;
		Вложение.АдресВоВременномХранилище = ОписаниеФайла.Хранение;
	КонецЦикла;
	
	УстановитьТекстПриложенныеФайлы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлВоВложенияПриПомещенииФайлов(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныеФайлы = Неопределено Или ПомещенныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьФайлыВСписок(ПомещенныеФайлы);
	ОбновитьПредставлениеВложений();
	
КонецПроцедуры

&НаКлиенте
Функция ВыбранноеВложение()
	
	Результат = Неопределено;
	ТекущиеДанные = Элементы.Вложения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		НаименованиеВложения = ТекущиеДанные[Элементы.Вложения.ТекущийЭлемент.Имя];
		Для Каждого Вложение Из Объект.Вложения Цикл
			Если Вложение.Представление = НаименованиеВложения Тогда
				Результат = Вложение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция АдресХранилищаВложений(Знач Вложения, АдресХранилища)

	Возврат ПоместитьВоВременноеХранилище(Вложения.Выгрузить(), АдресХранилища);

КонецФункции

&НаКлиенте
Процедура ОткрытьПриложенныеФайлы(СтандартнаяОбработка);

	СтандартнаяОбработка = Ложь;
	
	ПараметрыПриложенныхФайлов = Новый Структура;
	ПараметрыПриложенныхФайлов.Вставить("АдресХранилища", АдресХранилищаВложений(Объект.Вложения, АдресХранилища));
	ПараметрыПриложенныхФайлов.Вставить("УникальныйИдентификаторВладельца", УникальныйИдентификатор);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьПриложенныеФайлыЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ор_ОбратнаяСвязь.Форма.ПриложенныеФайлы", 
		ПараметрыПриложенныхФайлов, ЭтотОбъект,,,,ОписаниеОповещения);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ОткрытьПриложенныеФайлыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		АдресХранилища = Результат.АдресХранилища;
		ЗагрузитьВложения();
		ОбновитьПредставлениеВложений();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВложения()
	
	ТаблицаВложений = ПолучитьИзВременногоХранилища(АдресХранилища);
	Объект.Вложения.Загрузить(ТаблицаВложений);
	УстановитьТекстПриложенныеФайлы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВложение()
	
	ВыбранноеВложение = ВыбранноеВложение();
	Если ВыбранноеВложение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		ПолучитьФайл(ВыбранноеВложение.АдресВоВременномХранилище, ВыбранноеВложение.Представление, Истина);
	#Иначе
		ДополнительныеПараметры = Новый Структура("ВыбранноеВложение", ВыбранноеВложение);
		ОписаниеОповещения = 
			Новый ОписаниеОповещения("ОткрытьВложениеСозданиеКаталогаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		НачатьСозданиеКаталога(ОписаниеОповещения, ПолучитьИмяВременногоФайла());
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВложениеСозданиеКаталогаЗавершение(ИмяВременнойПапки, ДополнительныеПараметры) Экспорт
	
	Если ИмяВременнойПапки = "" Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранноеВложение = ДополнительныеПараметры.ВыбранноеВложение;
	ИмяВременногоФайла = 
		ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяВременнойПапки) + ВыбранноеВложение.Представление;
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ВыбранноеВложение.АдресВоВременномХранилище);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ДополнительныеПараметры.Вставить("ИмяВременнойПапки", ИмяВременнойПапки);
	ДополнительныеПараметры.Вставить("ИмяВременногоФайла", ИмяВременногоФайла);
	ОписаниеОповещения = 
		Новый ОписаниеОповещения("ОткрытьВложениеУстановкаТолькоЧтениеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Файл = Новый Файл(ИмяВременногоФайла);
	Файл.НачатьУстановкуТолькоЧтения(ОписаниеОповещения, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВложениеУстановкаТолькоЧтениеЗавершение(ДополнительныеПараметры) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьВложениеЗапускПриложенияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	НачатьЗапускПриложения(ОписаниеОповещения, ДополнительныеПараметры.ИмяВременногоФайла,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВложениеЗапускПриложенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Файл = Новый Файл(ДополнительныеПараметры.ИмяВременногоФайла);
	Файл.НачатьУстановкуТолькоЧтения(, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПочтой

&НаКлиенте
Процедура СформироватьТекстСообщения()

	// Тема сообщения
	ШаблонТемы = НСтр("ru='Обратная связь %1, версия %2 от %3'");
	
	ДатаСообщения = Формат(НачалоДня(ТекущаяДата()), "ДФ=dd.MM.yy");
	ТемаСообщения = СтрШаблон(ШаблонТемы, НаименованиеКонфигурации, ТекущаяВерсияКонфигурации, ДатаСообщения);
	
	ТекстСообщения.Очистить();
	
	ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru='Конфигурация: %1, версия %2'"), 
		НаименованиеКонфигурации, ТекущаяВерсияКонфигурации));
	ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru='Рег. номер: %1, программа зарегистрирована на %2'"), 
		РегистрационныйНомер, ОрганизацияНаКоторуюПрограммаЗарегистрирована));
	ТекстСообщения.ДобавитьСтроку("");
	
	#Область СтраницаОценивания
	// Оценка программы по шкале
	Если ЗначениеЗаполнено(ПростотаВРаботе)
		Или ЗначениеЗаполнено(Удобство)
		Или ЗначениеЗаполнено(СоответствиеТребованиям) Тогда
		
		ТекстСообщения.ДобавитьСтроку(НСтр("ru='Оценка программы по 10-бальной шкале:'"));
		
		Если ЗначениеЗаполнено(ПростотаВРаботе) Тогда
			ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru=' - Простота в работе: %1'"), ПростотаВРаботе));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Удобство) Тогда
			ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru=' - Удобство: %1'"), Удобство));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СоответствиеТребованиям) Тогда
			ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru=' - Соответствие требованиям: %1'"), СоответствиеТребованиям));
		КонецЕсли;
		ТекстСообщения.ДобавитьСтроку("");
	КонецЕсли;
	
	// Оценка линии консультации
	Если ЗначениеЗаполнено(ОперативностьОтвета) Или ЗначениеЗаполнено(ПолнотаОтвета) Тогда
		ТекстСообщения.ДобавитьСтроку(НСтр("ru='Оценка работы линии консультации по 10-бальной шкале:'"));
		
		Если ЗначениеЗаполнено(ОперативностьОтвета) Тогда
			ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru=' - Оперативность ответа: %1'"), ОперативностьОтвета));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПолнотаОтвета) Тогда
			ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru=' - Полнота ответа: %1'"), ПолнотаОтвета));
		КонецЕсли;
		ТекстСообщения.ДобавитьСтроку("");
	КонецЕсли;
	#КонецОбласти
	
	#Область СтраницаЧастоИспользуемыеОтраслевыеМеханизмы
	ОтраслевыеМеханизмы = "";
	
	МассивСтруктурРеквизитов = ПолучитьМассивСтруктурРеквизитовОтраслевыхМеханизмов();
	Для Каждого ЭлементМассива Из МассивСтруктурРеквизитов Цикл
		Если ЭтотОбъект[ЭлементМассива.ИмяРеквизита] Тогда
			ОтраслевыеМеханизмы = 
				ОтраслевыеМеханизмы + СтрШаблон(НСтр("ru=' - %1'"), ЭлементМассива.ЗаголовокМеханизма) + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПустаяСтрока(ОтраслевыеМеханизмы) Тогда
		ТекстСообщения.ДобавитьСтроку(НСтр("ru='Отраслевые механизмы и сервисы, используемые чаще всего:'"));
		ТекстСообщения.ДобавитьСтроку(ОтраслевыеМеханизмы);
	КонецЕсли;
	#КонецОбласти
	
	#Область СтраницаПовышениеУдобстваРаботы
	Если ЗначениеЗаполнено(НеобходимыеСопроводительныеМатериалы) Тогда
		ТекстСообщения.ДобавитьСтроку(НСтр("ru='Механизмы программы, которые требуют дополнительных сопроводительных материалов:'"));
		ТекстСообщения.ДобавитьСтроку(НеобходимыеСопроводительныеМатериалы);
		ТекстСообщения.ДобавитьСтроку("");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТрудностиСФункционалом) Тогда
		ТекстСообщения.ДобавитьСтроку(НСтр("ru='Работа с каким функционалом вызывает трудности:'"));
		ТекстСообщения.ДобавитьСтроку(ТрудностиСФункционалом);
		ТекстСообщения.ДобавитьСтроку("");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УдачныеПримерыРеализации) Тогда
		ТекстСообщения.ДобавитьСтроку(НСтр("ru='Удачные примеры реализации описанных выше механизмов:'"));
		ТекстСообщения.ДобавитьСтроку(УдачныеПримерыРеализации);
		ТекстСообщения.ДобавитьСтроку("");
	КонецЕсли;
	#КонецОбласти
	
	#Область СтраницаПожеланиеПоРазвитию
	Если ЗначениеЗаполнено(КакойМеханизмНеобходимоДобавить) Тогда
		ТекстСообщения.ДобавитьСтроку(НСтр("ru='Отраслевой механизм, который необходимо добавить в программу:'"));
		ТекстСообщения.ДобавитьСтроку(КакойМеханизмНеобходимоДобавить);
		ТекстСообщения.ДобавитьСтроку("");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УдачныеПримерыРеализацииПоПожеланию) Тогда
		ТекстСообщения.ДобавитьСтроку(НСтр("ru='Удачные примеры реализации описанных выше механизмов:'"));
		ТекстСообщения.ДобавитьСтроку(УдачныеПримерыРеализацииПоПожеланию);
		ТекстСообщения.ДобавитьСтроку("");
	КонецЕсли;
	#КонецОбласти
	
	#Область Вложения
	Если ЕстьПользовательскиеВложения() Тогда
		ТекстВложения = НСтр("ru='Приложены файлы, которые могут помочь лучше понять примеры реализации механизмов.'");
		ТекстСообщения.ДобавитьСтроку(ТекстВложения);
		ТекстСообщения.ДобавитьСтроку("");
	КонецЕсли;
	#КонецОбласти
	
	#Область ТехническаяИнформация
	ТехническаяИнформация = ПолучитьТехническуюИнформацию();
	ТекстСообщения.ДобавитьСтроку(НСтр("ru = 'Техническая информация о программе:'"));
	ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru = 'Версия платформы: %1'"), ТехническаяИнформация.ВерсияПлатформы));
	ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru = 'Вид приложения: %1'"), ВидПриложения));
	ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru = 'Режим: %1'"), ТехническаяИнформация.Режим));
	ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru = 'Количество пользователей: %1'"),
		ТехническаяИнформация.КоличествоПользователей));
	ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru = 'Логин для подключения Интернет-поддержки: %1'"),
		ЛогинПользователя));
	ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru = 'Идентификатор для обращения в службу технической поддержки: %1'"),
		ТехническаяИнформация.ИдентификаторИнформационнойБазы));
	ТекстСообщения.ДобавитьСтроку("");
	
	ТекстСообщения.ДобавитьСтроку(СтрШаблон("%1, %2", ИмяПользователя, Должность));
	ТекстСообщения.ДобавитьСтроку(СтрШаблон(НСтр("ru='Ответ прошу прислать на адрес: %1'"), АдресОтвета));
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПочтовоеСообщениеНаСервере()
	
	ПараметрыПисьма = СформироватьПараметрыПисьма();
	Если ПараметрыПисьма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(УчетнаяЗапись, ПараметрыПисьма);
	РезультатОтправки = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(УчетнаяЗапись, Письмо);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПочтовоеСообщение()
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите учетную запись электронной почты.'"),,"УчетнаяЗапись");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ТемаСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите тему сообщения.'"),,"ТемаСообщения");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ТекстСообщения.ПолучитьТекст()) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите текст сообщения.'"),,"ТекстСообщения");
		Возврат;
	КонецЕсли;
	
	ОтправитьПочтовоеСообщениеНаСервере();
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Сообщение успешно отправлено'")
		,
		,
		СтрШаблон(НСтр("ru = 'Спасибо за обратную связь!
		|%1'"))
		);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция СформироватьПараметрыПисьма()
	
	ПараметрыПисьма = Новый Структура;
	
	ПараметрыПисьма.Вставить("Кому",         Обработки.ор_ОбратнаяСвязь.АдресТехподдержки());
	ПараметрыПисьма.Вставить("СкрытыеКопии", "");
	ПараметрыПисьма.Вставить("АдресОтвета",  АдресОтвета);
	ПараметрыПисьма.Вставить("Тема",         ТемаСообщения);
	ПараметрыПисьма.Вставить("Тело",         ТекстСообщения.ПолучитьТекст());
	ПараметрыПисьма.Вставить("Вложения",     Вложения());
	
	Возврат ПараметрыПисьма;
	
КонецФункции

&НаСервере
Функция Вложения()
	
	Результат = Новый Массив;
	Для Каждого Вложение Из Объект.Вложения Цикл
		ОписаниеВложения = Новый Структура;
		ОписаниеВложения.Вставить("Представление",             Вложение.Представление);
		ОписаниеВложения.Вставить("АдресВоВременномХранилище", Вложение.АдресВоВременномХранилище);
		ОписаниеВложения.Вставить("Идентификатор",             Вложение.Идентификатор);
		Результат.Добавить(ОписаниеВложения);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьУчетнуюЗапись()
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ДоступныеУчетныеЗаписи = РаботаСПочтовымиСообщениями.ДоступныеУчетныеЗаписи(Истина);
		Если ДоступныеУчетныеЗаписи.Количество() > 0 Тогда
			УчетнаяЗапись = ДоступныеУчетныеЗаписи[0].Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Если НЕ ЗначениеЗаполнено(АдресОтвета) И УчетнаяЗапись.ИспользоватьДляПолучения Тогда
			АдресОтвета = УчетнаяЗапись.АдресЭлектроннойПочты;
		КонецЕсли;
		
		ИмяПользователя = УчетнаяЗапись.ИмяПользователя;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьПользовательскиеВложения()
	
	ПользовательскиеВложения = Объект.Вложения.НайтиСтроки(Новый Структура("Идентификатор", ""));
	Возврат ПользовательскиеВложения.Количество() > 0;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивСтруктурРеквизитовОтраслевыхМеханизмов()
	
	МассивСтруктурРеквизитов = Новый Массив();
	
	Для Каждого Реквизит Из ПолучитьРеквизиты() Цикл
		
		ИмяРеквизита = Реквизит.Имя;
		Если Не СтрНачинаетсяС(ИмяРеквизита, "ор_") ИЛИ ИмяРеквизита = "ор_ЭлементыСозданыПрограммно" Тогда
			Продолжить;
		КонецЕсли;
		
		Структура = Новый Структура();
		Структура.Вставить("ИмяРеквизита",       ИмяРеквизита);
		Структура.Вставить("ЗаголовокМеханизма", Реквизит.Заголовок);
		МассивСтруктурРеквизитов.Добавить(Структура);
		
	КонецЦикла;
	
	Возврат МассивСтруктурРеквизитов
	
КонецФункции

#КонецОбласти

#Область ИнтернетПоддержкаПользователей

&НаКлиенте
Процедура ДекорацияПодключитьИнтернетПоддержкуОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если ВРег(НавигационнаяСсылкаФорматированнойСтроки) = ВРег("ПодключитьсяКИнтернетПоддержке") Тогда
		СтандартнаяОбработка = Ложь;
		ПодключитьИнтернетПоддержку(КодВозвратаДиалога.Да, Новый Структура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержку(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(ОписаниеОповещения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		ПодключенаИнтернетПоддержка = Истина;
		ЛогинПользователя = Результат.Логин;
		Элементы.ДекорацияПодключитьИнтернетПоддержку.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ЦентрМониторинга

&НаСервереБезКонтекста
Функция ПолучитьПараметрыЦентраМониторинга()
	МодульЦентрМониторингаСлужебный = ОбщегоНазначения.ОбщийМодуль("ЦентрМониторингаСлужебный");
	ПараметрыЦентраМониторинга = МодульЦентрМониторингаСлужебный.ПолучитьПараметрыЦентраМониторингаВнешнийВызов();
	
	ПараметрыСервисаПоУмолчанию = МодульЦентрМониторингаСлужебный.ПолучитьПараметрыПоУмолчаниюВнешнийВызов();
	ПараметрыЦентраМониторинга.Вставить("СерверПоУмолчанию", ПараметрыСервисаПоУмолчанию.Сервер);
	ПараметрыЦентраМониторинга.Вставить("АдресРесурсаПоУмолчанию", ПараметрыСервисаПоУмолчанию.АдресРесурса);
	ПараметрыЦентраМониторинга.Вставить("ПортПоУмолчанию", ПараметрыСервисаПоУмолчанию.Порт);
	
	Возврат ПараметрыЦентраМониторинга;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПереключательОтправкиДанных(ВключитьЦентрМониторинга, ЦентрОбработкиИнформацииОПрограмме)
	Состояние = ?(ВключитьЦентрМониторинга, "1", "0") + ?(ЦентрОбработкиИнформацииОПрограмме, "1", "0");
	
	Если Состояние = "00" Тогда
		Результат = 2;
	ИначеЕсли Состояние = "01" Тогда
		Результат = 1;
	ИначеЕсли Состояние = "10" Тогда
		Результат = 0;
	ИначеЕсли Состояние = "11" Тогда
		// А такого быть не может...
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьАдресСервиса()
	
	ПараметрыЦентраМониторинга = ПолучитьПараметрыЦентраМониторинга();
			
	ПараметрыСервиса = Новый Структура("Сервер, АдресРесурса, Порт");
	
	Если ЦентрМониторингаРазрешитьОтправлятьДанные = 0 Тогда
		ПараметрыСервиса.Сервер = ПараметрыЦентраМониторинга.СерверПоУмолчанию;
		ПараметрыСервиса.АдресРесурса = ПараметрыЦентраМониторинга.АдресРесурсаПоУмолчанию;
		ПараметрыСервиса.Порт = ПараметрыЦентраМониторинга.ПортПоУмолчанию;
	ИначеЕсли ЦентрМониторингаРазрешитьОтправлятьДанные = 1 Тогда
		ПараметрыСервиса.Сервер = ПараметрыЦентраМониторинга.Сервер;
		ПараметрыСервиса.АдресРесурса = ПараметрыЦентраМониторинга.АдресРесурса;
		ПараметрыСервиса.Порт = ПараметрыЦентраМониторинга.Порт;
	ИначеЕсли ЦентрМониторингаРазрешитьОтправлятьДанные = 2 Тогда
		ПараметрыСервиса = Неопределено;	
	КонецЕсли;
	
	Если ПараметрыСервиса <> Неопределено Тогда
		Если ПараметрыСервиса.Порт = 80 Тогда
			Схема = "http://";
			Порт = "";
		ИначеЕсли ПараметрыСервиса.Порт = 443 Тогда
			Схема = "https://";
			Порт = "";
		Иначе
			Схема = "http://";
			Порт = ":" + Формат(ПараметрыСервиса.Порт, "ЧН=0; ЧГ=");
		КонецЕсли;
		
		АдресСервиса = Схема + ПараметрыСервиса.Сервер + Порт + "/" + ПараметрыСервиса.АдресРесурса;
	Иначе
		АдресСервиса = "";
	КонецЕсли;
	
	Возврат АдресСервиса;
КонецФункции

&НаСервереБезКонтекста
Процедура РазрешитьОтправлятьДанныеПриИзмененииНаСервере(ПараметрыЦентраМониторинга, РезультатЗапуска)
	МодульЦентрМониторингаСлужебный = ОбщегоНазначения.ОбщийМодуль("ЦентрМониторингаСлужебный");
	МодульЦентрМониторингаСлужебный.УстановитьПараметрыЦентраМониторингаВнешнийВызов(ПараметрыЦентраМониторинга);
	
	ВключитьЦентрМониторинга = ПараметрыЦентраМониторинга.ВключитьЦентрМониторинга;
	ЦентрОбработкиИнформацииОПрограмме = ПараметрыЦентраМониторинга.ЦентрОбработкиИнформацииОПрограмме;
	
	Результат = ПолучитьПереключательОтправкиДанных(ВключитьЦентрМониторинга, ЦентрОбработкиИнформацииОПрограмме);
	
	Если Результат = 0 Или Результат = 1 Тогда
		// Отправка ознакомительного пакета.
		РезультатЗапуска = МодульЦентрМониторингаСлужебный.ЗапускОтправкиОзнакомительногоПакета();
	КонецЕсли;
	
	Если Результат = 0 Тогда
		// Включение задания сбора и отправки статистики.
		РегЗадание = МодульЦентрМониторингаСлужебный.ПолучитьРегламентноеЗаданиеВнешнийВызов("СборИОтправкаСтатистики", Истина);
		МодульЦентрМониторингаСлужебный.УстановитьРасписаниеПоУмолчаниюВнешнийВызов(РегЗадание);
	ИначеЕсли Результат = 1 Тогда
		РегЗадание = МодульЦентрМониторингаСлужебный.ПолучитьРегламентноеЗаданиеВнешнийВызов("СборИОтправкаСтатистики", Истина);
		МодульЦентрМониторингаСлужебный.УстановитьРасписаниеПоУмолчаниюВнешнийВызов(РегЗадание);
	ИначеЕсли Результат = 2 Тогда
		МодульЦентрМониторингаСлужебный.УдалитьРегламентноеЗаданиеВнешнийВызов("СборИОтправкаСтатистики");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЦентрМониторингаАдресСервисаПриИзмененииНаСервере(СтруктураАдреса)
	ПараметрыЦентраМониторинга = Новый Структура();
	ПараметрыЦентраМониторинга.Вставить("Сервер", СтруктураАдреса.Хост);
	ПараметрыЦентраМониторинга.Вставить("АдресРесурса", СтруктураАдреса.ПутьНаСервере);
	ПараметрыЦентраМониторинга.Вставить("Порт", СтруктураАдреса.Порт);
	ПараметрыЦентраМониторинга.Вставить("ЗащищенноеСоединение", СтруктураАдреса.ЗащищенноеСоединение);
	
	МодульЦентрМониторингаСлужебный = ОбщегоНазначения.ОбщийМодуль("ЦентрМониторингаСлужебный");
	МодульЦентрМониторингаСлужебный.УстановитьПараметрыЦентраМониторингаВнешнийВызов(ПараметрыЦентраМониторинга);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТехническуюИнформацию()
	
	ТехническаяИнформация = Новый Структура;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТехническаяИнформация.Вставить("ВерсияПлатформы", СистемнаяИнформация.ВерсияПриложения);
	
	ЭтоФайловаяИБ = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	ТехническаяИнформация.Вставить("Режим", ?(ЭтоФайловаяИБ, НСтр("ru = 'Файловый'"), НСтр("ru = 'Серверный'")));
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(Пользователи.Ссылка) КАК КоличествоПользователей
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ПометкаУдаления = ЛОЖЬ");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоПользователей = Выборка.КоличествоПользователей;
	Иначе
		КоличествоПользователей = 0;
	КонецЕсли;
	ТехническаяИнформация.Вставить("КоличествоПользователей", КоличествоПользователей);
	
	Попытка
		ИдентификаторИнформационнойБазы = ЦентрМониторинга.ИдентификаторИнформационнойБазы();
	Исключение
		ИдентификаторИнформационнойБазы = НСтр("ru = 'Ошибка при получении идентификатора'");
	КонецПопытки;
	ТехническаяИнформация.Вставить("ИдентификаторИнформационнойБазы", ИдентификаторИнформационнойБазы);
	
	Возврат ТехническаяИнформация;
	
КонецФункции

#КонецОбласти

#КонецОбласти
